import React from 'react'
import './mainpage.css'

export default function Mainpage() {
    return (
        <div>
            

            <h1>भारतीय न्याय संहिता 2023 जानकारी पोर्टल</h1>
            <p>सरकारी नहीं — केवल शैक्षिक उद्देश्य के लिए</p>

            <div className="slider">
                <div className="slides">
                    <div>🔍 सरल शब्दों में समझिए - भारतीय न्याय संहिता 2023 क्या है</div>
                    <div>📚 नए कानून, पुराने बदलाव — सबकुछ एक ही जगह</div>
                    <div>🧠 छात्र, नागरिक और शिक्षकों के लिए उपयोगी जानकारी</div>
                </div>
            </div>
            <div className="content">
                <h2>स्वागत है आपके अपने BNS सूचना पोर्टल में</h2>
                <p>
                    हमारा उद्देश्य है कि भारतीय न्याय संहिता 2023 की जानकारी को सरल और स्पष्ट भाषा में देश के हर नागरिक तक पहुँचाया जाए। यह वेबसाइट सरकारी नहीं है, बल्कि एक ज्ञानवर्धक प्लेटफॉर्म है जो छात्रों, शिक्षकों और आम लोगों के लिए उपयोगी है। हम यथासंभव सरल भाषा में जानकारी देने का प्रयास करते हैं।
                </p>
            </div>

            <footer>
                <strong>Disclaimer:</strong> यह गैर-सरकारी साइट है, केवल ज्ञानवर्धन हेतु बनाई गई है।
            </footer>
        </div>
    )
}
